---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PointCloudEngineRegistry Methods
PointCloudEngineRegistry Class See Also Send Feedback
---

The PointCloudEngineRegistry type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetSupportedEngines | Returns a list of the identifiers supported by point cloud engines registered to Revit. |
|  | IsEngineFileBased | Identifies if a given engine is file-based. |
|  | RegisterPointCloudEngine | Registers a new point cloud engine and associates it to a particular file extension. |
|  | UnregisterPointCloudEngine | Unregisters the point cloud engine associated to a particular identifier. |

# See Also

PointCloudEngineRegistry Class

Autodesk.Revit.DB.PointClouds Namespace